## Pandas aggregation and Pivot Tables

In [32]:
# import 

import pandas as pd 
import  numpy as np

### Data loading

In [23]:
# Data loading
df_titanic =  pd.read_csv("./data/titanic.csv")
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1.0,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
1,2.0,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
2,3.0,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,NaN,S
3,4.0,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
4,5.0,0.0,3,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,NaN,S

### Data Cleaning

In [ ]:
# remove duplicates
df_titanic = df_titanic.drop_duplicates()

In [25]:
# remove null values 
df_titanic = df_titanic.dropna()

In [34]:
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
Index: 476 entries, 1 to 1390
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  476 non-null    float64
 1   Survived     476 non-null    float64
 2   Pclass       476 non-null    object
 3   Name         476 non-null    object
 4   Sex          476 non-null    object
 5   Age          476 non-null    float64
 6   SibSp        476 non-null    float64
 7   Parch        476 non-null    float64
 8   Ticket       476 non-null    object
 9   Fare         476 non-null    float64
 10  Cabin        476 non-null    object
 11  Embarked     476 non-null    object
dtypes: float64(6), object(6)
memory usage: 48.3+ KB

### Group_by

In [35]:
# Groupby "sex" and find the average Fare For Each Sex
df_titanic.groupby("Sex")["Fare"].mean()

Sex
female    57.132966
male      52.133817
Name: Fare, dtype: float64

In [37]:
df_titanic["Sex"].value_counts()

Sex
male      250
female    226
Name: count, dtype: int64

In [36]:
# Groupby "sex" "Pclass" and get the agg
df_titanic.groupby(["Sex","Pclass"])["Fare"].agg(["min","max","mean","count"])

                  min       max       mean  count
Sex    Pclass
female 1       6.4375  263.0000  82.304167     97
       2       4.0125  221.7792  30.225558     45
       3       4.0125  262.3750  30.636326     46
       ?       7.1250  227.5250  56.819079     38
male   1       0.0000  512.3292  63.890185    121
       2       5.0000  135.6333  38.248796     45
       3       7.5500  512.3292  50.323031     36
       ?       0.0000  247.5208  36.873269     48

### Pivot Tables

The pivot() function in pandas is used to create a pivot table from a DataFrame. It allows you to summarize and aggregate data in a very flexible way.

```python

DataFrame.pivot(
    index=None,
    columns=None, 
    values=None)

```


Parameters:

    index: column or array-like — Column(s) to use as the new index.
    columns: column or array-like — Column(s) to use as the new columns.
    values: column or array-like — The column(s) to use for the values in the new DataFrame.

### Pivot Table

pivot table to count the number of passegers per class

In [38]:
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2.0,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
3,4.0,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
6,7.0,0.0,1,"McCarthy, Mr. Timothy J",male,54.0,0.0,0.0,17463,51.8625,E46,S
10,11.0,1.0,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1.0,1.0,PP 9549,16.7000,G6,S
11,12.0,1.0,1,"Bonnell, Miss. Elizabeth",female,58.0,0.0,0.0,113783,26.5500,C103,S

In [ ]:
# pivot table
df_titanic.pivot(columns="Sex",values=["Age","Fare"]).mean()

      Sex
Age   female    30.959867
      male      34.748680
Fare  female    57.132966
      male      52.133817
dtype: float64

#### Pivoting Titanic Data to Show Average Age for Each Survival Group

In [49]:
# a pivot table on "Survived"
df_titanic.pivot(columns="Survived",values="Age").mean()

Survived
0.0    33.974450
1.0    32.083992
dtype: float64

In [51]:
df_titanic.pivot(columns="Survived")["Age"].mean()

Survived
0.0    33.974450
1.0    32.083992
dtype: float64

### Pivot table with aggregate functions

Common Aggregation Functions in Pandas:

    Sum (sum): Adds up all the values in a column or group.
    Mean (mean): Computes the average of the values in a column or group.
    Count (count): Counts the number of non-NA/null entries in a column or group.
    Minimum (min): Finds the smallest value in a column or group.
    Maximum (max): Finds the largest value in a column or group.
    Standard Deviation (std): Computes the standard deviation of the values in a column or group.
    Variance (var): Computes the variance of the values in a column or group.
    Median (median): Finds the middle value in a column or group.
    First (first): Returns the first value in a column or group.
    Last (last): Returns the last value in a column or group.

In [53]:
# pivot with aggregate functions 
df_titanic.pivot(columns="Survived",values="Age").agg(["min","max","mean","count"])

Survived        0.0         1.0
min         0.42000    0.420000
max        74.00000   80.000000
mean       33.97445   32.083992
count     218.00000  258.000000

### Multiple Columns

In [58]:
# pivoting on multiple columns 
df_titanic.pivot(columns=["Sex","Pclass"],values=["Fare"]).agg(["min","max","mean","count"])

              Fare                                                  \
Sex         female        male      female        male      female
Pclass           1           1           3           2           2
min       6.437500    0.000000    4.012500    5.000000    4.012500
max     263.000000  512.329200  262.375000  135.633300  221.779200
mean     82.304167   63.890185   30.636326   38.248796   30.225558
count    97.000000  121.000000   46.000000   45.000000   45.000000


Sex           male                  female
Pclass           3           ?           ?
min       7.550000    0.000000    7.125000
max     512.329200  247.520800  227.525000
mean     50.323031   36.873269   56.819079
count    36.000000   48.000000   38.000000